AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/АР_ГруппыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ГруппыУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АР_РасчетыПоДоговорам/Ext/Module.bsl
Процедура АР_РасчетыПоДоговорамПроведениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Возврат;
	
	Если Источник.Дата >= Дата('20190101') Тогда
	
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
		
			ПроведениеРеализацияПоступленияНаРасчетныйСчет(Источник);
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда	
			
			Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
			Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
			Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаДолга") Тогда
			
			Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
			Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
			Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура АР_РасчетыПоДоговорамЗаписьПриЗаписи(Источник, Отказ) Экспорт
	
	//Возврат;
	
	Если Источник.Движения.АР_РасчетыПоДоговорам.Количество() > 0 Тогда // Очищаем то что ввели руками или было введено ранее
		
		Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
		
	КонецЕсли;
	
	Если Источник.ПометкаУдаления Или Источник.Дата < Дата('20190101') Тогда Возврат; КонецЕсли; // Удаленные и до 2019 не обрабатываем
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		КодДт = Стр.СчетДт.Код; КодКт = Стр.СчетКт.Код;
		
		
		Если // Стек оплаты
			(
				(КодДт = "62.04" И КодКт = "62.01")
				ИЛИ (КодДт = "62.02" И КодКт = "62.01")
				ИЛИ (КодДт = "76.09" И КодКт = "76.09")
				ИЛИ (КодДт = "76.09" И КодКт = "76.09.1")
			)		
			И ТипЗнч(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")
			И ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Тогда
		
			Договор = Стр.СубконтоКт.Договоры;
			ЗДА = ПолучитьЗДА(Договор);
			Если ЗДА <> Неопределено Тогда
				
				Данные = Новый Структура;
				Данные.Вставить("ДокументРасчета", Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами); 
				Данные.Вставить("ДоговорКонтрагента", Договор);
				Данные.Вставить("Сумма", Стр.Сумма);
				
				ПровестиОплату(Источник, Данные);
				
			КонецЕсли;
		
		ИначеЕсли КодДт = "76.06" И КодКт = "62.01" // Стек перенос долга по реализациям
			И ТипЗнч(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			И ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Тогда
		
		    ЗДА = ПолучитьЗДА(Стр.СубконтоДт.Договоры);
			Если ЗДА <> Неопределено Тогда
				СторноДолга(Источник, Стр.СубконтоДт.Договоры, Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами, Стр.Сумма);
			КонецЕсли;
			
			ЗДА = ПолучитьЗДА(Стр.СубконтоКт.Договоры);
			Если ЗДА <> Неопределено Тогда
				Данные = Новый Структура;
				Данные.Вставить("ДокументРасчета", Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами); 
				Данные.Вставить("ДоговорКонтрагента", Стр.СубконтоКт.Договоры);
				Данные.Вставить("Сумма", Стр.Сумма);
					
				ПровестиОплату(Источник, Данные);
			КонецЕсли;
			
		ИначеЕсли КодДт = "76.09" И КодКт = "76.09" // Стек зачет оплата ввода начальных остатков
			И ТипЗнч(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом")
			И ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		Тогда

			ЗДА = ПолучитьЗДА(Стр.СубконтоКт.Договоры);
			Если ЗДА <> Неопределено Тогда
				Данные = Новый Структура;
				Данные.Вставить("ДокументРасчета", Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами); 
				Данные.Вставить("ДоговорКонтрагента", Стр.СубконтоКт.Договоры);
				Данные.Вставить("Сумма", Стр.Сумма);
				
				ПровестиОплату(Источник, Данные);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Источник.Движения.АР_РасчетыПоДоговорам.Записать();
	
КонецПроцедуры

#Область ОбработчикиДанных

Функция ПолучитьЗДА(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Первые 1 Док.Ссылка Из Документ.АР17_ЗаключениеДоговораАренды КАК Док Где Док.ДоговорКонтрагента = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда Возврат Рез.Ссылка;
	Иначе Возврат Неопределено КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеЗДА(Договор)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Док.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды КАК Док
	                      |ГДЕ
	                      |	Док.Проведен
	                      |	И Док.ДоговорКонтрагента = &ДоговорКонтрагента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка КАК Ссылка,
	                      |	ТЧ.Услуга КАК Услуга,
	                      |	ТЧ.ГруппаУслуг КАК ГруппаУслуг
	                      |ПОМЕСТИТЬ Табл
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка,
	                      |	ТЧ.Услуга,
	                      |	ТЧ.ГруппаУслуг
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка,
	                      |	ТЧ.Услуга,
	                      |	ТЧ.ГруппаУслуг
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Т.Услуга КАК Услуга,
	                      |	Т.ГруппаУслуг КАК ГруппаУслуг,
	                      |	ЕСТЬNULL(Спр.Приоритет, 99999) КАК Приоритет,
	                      |	СУММА(0) КАК Остаток
	                      |ИЗ
	                      |	Табл КАК Т
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГруппыУслуг КАК Спр
	                      |		ПО Т.ГруппаУслуг = Спр.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Т.Услуга,
	                      |	Т.ГруппаУслуг,
	                      |	ЕСТЬNULL(Спр.Приоритет, 99999)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Приоритет");
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Табл = Запрос.Выполнить().Выгрузить();
	
	Возврат Табл;
	
КонецФункции

Процедура ДобавитьПроводкуРеализации(Источник, ЗДА, Стр, Группа, Т = Неопределено)
	
	Движения = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Нов							=	Движения.Добавить();
	Нов.Период					=	Источник.Дата;
	Нов.ВидДвижения				=	?(Т = Неопределено, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	Нов.Месяц					=	НачалоМесяца(Источник.Дата);
	Нов.Контрагент				=	Источник.Контрагент;
	Нов.ДоговорКонтрагента		=	Источник.ДоговорКонтрагента;
	Нов.Сумма					=	?(Т = Неопределено, Стр.Сумма, Т.СуммаПлан);
	Нов.ГруппаУслуг				=	Группа;
	Нов.Организация				=	Источник.Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокументов

Процедура ПроведениеРеализацияПоступленияНаРасчетныйСчет(Источник) Экспорт
	
	Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
	Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
	Источник.Движения.АР_РасчетыПоДоговорам.Записать();
	Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
	
	Если Источник.Движения.Хозрасчетный.Количество() = 0 Тогда
		
		Источник.Движения.Хозрасчетный.Прочитать();
		
	КонецЕсли;
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Тип");
	Табл.Колонки.Добавить("ДоговорКонтрагента");
	Табл.Колонки.Добавить("ДокументРасчета");
	Табл.Колонки.Добавить("Сумма");
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		КодДт = Стр.СчетДт.Код; 
		КодКт = Стр.СчетКт.Код;
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ( // Проводки продажи
		(КодДт = "62.01" И КодКт = "76.06") ИЛИ
		(КодДт = "62.01" И КодКт = "91.01") ИЛИ
		(КодДт = "62.01" И КодКт = "90.01.1") ИЛИ
		(СтрНайти(КодДт,"76.05") <> 0 И КодКт = "90.01.1") ИЛИ
		(КодДт = "76.06" И КодКт = "76.06") ИЛИ
		(КодДт = "76.06" И КодКт = "90.01.1") ИЛИ
		(КодДт = "76.09" И КодКт = "76.06")
		) Тогда
		
			Нов						=	Табл.Добавить();
			Нов.Тип					=	"Реализация";
			Нов.ДоговорКонтрагента	=	Стр.СубконтоДт.Договоры;
			Нов.ДокументРасчета		=	Источник.Ссылка;
			Нов.Сумма				=	Стр.Сумма;
		
		ИначеЕсли ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ( // Проводки оплаты
		(КодДт = "51" И КодКт = "62.01") ИЛИ
		(КодДт = "51" И КодКт = "76.06") ИЛИ
		(КодДт = "51" И КодКт = "76.09") ИЛИ
		(КодДт = "62.02" И КодКт = "62.01") ИЛИ
		(КодДт = "76.09" И КодКт = "76.09")
		) Тогда
		
			Нов						=	Табл.Добавить();
			Нов.Тип					=	"Оплата";
			Нов.ДоговорКонтрагента	=	Стр.СубконтоКт.Договоры;
			Нов.ДокументРасчета		=	Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами;
			Нов.Сумма				=	Стр.Сумма;
			
		Иначе
			
			Если НЕ (
				(КодДт = "51" И КодКт = "62.02") ИЛИ
				(КодДт = "51" И КодКт = "62.04") ИЛИ
				(КодДт = "62.01" И КодКт = "62.01") ИЛИ
				(КодДт = "76.09" И КодКт = "62.01") ИЛИ
				(КодДт = "90.03" И КодКт = "68.02")
				)
				И
				(
				ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				) Тогда
				
					А = 1;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Табл.Свернуть("Тип, ДоговорКонтрагента, ДокументРасчета", "Сумма");
	Табл.Сортировать("Тип Убыв");
	
	ВТ = Табл.Скопировать(,"Тип");
	ВТ.Свернуть("Тип");
	
	Для Каждого Стр Из Табл Цикл
		
		ЗДА = ПолучитьЗДА(Стр.ДоговорКонтрагента);
		
		Если ЗДА <> Неопределено Тогда
			
			Если Стр.Тип = "Реализация" Тогда 
				
				СторнироватьПроведениеДоговораАренды(Источник);
				ПровестиДолг(Источник);
				Источник.Движения.АР_РасчетыПоДоговорам.Записать(); // на случай если реализация засчитывает сама по себе оплату
				
			ИначеЕсли Стр.Тип = "Оплата" И ЗначениеЗаполнено(Стр.ДокументРасчета) И ТипЗнч(Стр.ДокументРасчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				ПровестиОплату(Источник, Стр);
								
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВТ.Количество() = 2 Тогда
		
		ЕстьПриход = Ложь; ЕстьРасход = Ложь;
		
		Для Каждого Стр Из Источник.Движения.АР_РасчетыПоДоговорам Цикл
			
			Если Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда ЕстьПриход = Истина; КонецЕсли;
			Если Стр.ВидДвижения = ВидДвиженияНакопления.Расход Тогда ЕстьРасход = Истина; КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПриход = Ложь ИЛИ ЕстьРасход = Ложь Тогда
				
			А = 1;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СторнироватьПроведениеДоговораАренды(Источник)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Услуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Услуги.Номенклатура КАК Номенклатура,
	               |	Услуги.Сумма + ВЫБОР
	               |		КОГДА НЕ Услуги.Ссылка.ТипЦен.ЦенаВключаетНДС
	               |			ТОГДА Услуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма,
	               |	НАЧАЛОПЕРИОДА(Услуги.Ссылка.Дата, МЕСЯЦ) КАК Месяц
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	               |ГДЕ
	               |	Услуги.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	               |	АгентскиеУслуги.Номенклатура,
	               |	АгентскиеУслуги.Сумма + ВЫБОР
	               |		КОГДА НЕ АгентскиеУслуги.Ссылка.ТипЦен.ЦенаВключаетНДС
	               |			ТОГДА АгентскиеУслуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	НАЧАЛОПЕРИОДА(АгентскиеУслуги.Ссылка.Дата, МЕСЯЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК АгентскиеУслуги
	               |ГДЕ
	               |	АгентскиеУслуги.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Месяц КАК Месяц,
	               |	ВТ1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура,
	               |	ВТ1.ДоговорКонтрагента,
	               |	ВТ1.Месяц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.ДокументРасчетов КАК ДокументРасчетов,
	               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	ВТ2.Сумма КАК Сумма,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(//&Период
				   |		, ТИПЗНАЧЕНИЯ(ДокументРасчетов) = ТИП(Документ.Ар17_ПроведениеДоговораАренды)) КАК Рег
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	               |		ПО Рег.ДоговорКонтрагента = ВТ2.ДоговорКонтрагента
	               |			И Рег.Номенклатура = ВТ2.Номенклатура
	               |			И Рег.Месяц = ВТ2.Месяц";
	//Запрос.УстановитьПараметр("Период", Источник.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
					
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	НачалоМесяца(Источник.Дата);
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
		Нов.Организация			=	Источник.Организация;
		Нов.Контрагент			=	Источник.Контрагент;
		Нов.ДоговорКонтрагента	=	Источник.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Рез.ДокументРасчетов;
		Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
		Нов.Номенклатура		=	Рез.Номенклатура;
		Нов.Сумма				=	?(Рез.Сумма > Рез.СуммаОстаток, Рез.СуммаОстаток, Рез.Сумма);
					
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиДолг(Источник)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Табл = ПолучитьДанныеЗДА(Источник.ДоговорКонтрагента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Номенклатура КАК Номенклатура,
	               |	ТЧ.Сумма + ВЫБОР
	               |		КОГДА НЕ ТЧ.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТЧ.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК ТЧ
	               |ГДЕ
	               |	ТЧ.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЧ.Номенклатура,
	               |	ТЧ.Сумма + ВЫБОР
	               |		КОГДА НЕ ТЧ.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТЧ.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ТЧ
	               |ГДЕ
	               |	ТЧ.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Табл.Услуга КАК Номенклатура,
	               |	Табл.ГруппаУслуг КАК ГруппаУслуг
	               |ПОМЕСТИТЬ ВТ3
	               |ИЗ
	               |	&Табл КАК Табл
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ3.ГруппаУслуг, ЗНАЧЕНИЕ(Справочник.Ар_ГруппыУслуг.БезГруппы)) КАК ГруппаУслуг,
	               |	ВТ2.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ3 КАК ВТ3
	               |		ПО ВТ2.Номенклатура = ВТ3.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Табл", Табл);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	НачалоМесяца(Источник.Дата);
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
		Нов.Организация			=	Источник.Организация;
		Нов.Контрагент			=	Источник.Контрагент;
		Нов.ДоговорКонтрагента	=	Источник.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Источник.Ссылка;
		Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
		Нов.Номенклатура		=	Рез.Номенклатура;
		Нов.Сумма				=	Рез.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиОплату(Источник, Стр)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Период, ДокументРасчетов = &ДокументРасчетов) КАК Рег";
	Запрос.УстановитьПараметр("ДокументРасчетов", Стр.ДокументРасчета);
	Запрос.УстановитьПараметр("Период", Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая));
	
	СуммаКСписанию = Стр.Сумма;
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаКСписанию > 0 Тогда
		
			Нов = РасчетыПоДоговорам.Добавить();
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	НачалоМесяца(Стр.ДокументРасчета.Дата);
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
			Нов.Организация			=	Стр.ДоговорКонтрагента.Организация;
			Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
			Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
			Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	?(Рез.СуммаОстаток > СуммаКСписанию, СуммаКСписанию, Рез.СуммаОстаток);
			
			СуммаКСписанию			=	СуммаКСписанию - Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СторноДолга(Источник, Договор, ДокументРасчета, Сумма)
	
	Запрос = Новый Запрос("Выбрать * Из РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег Где Рег.Регистратор = &Реализация");
	Запрос.УстановитьПараметр("Реализация", ДокументРасчета);
	Рез = Запрос.Выполнить().Выбрать();
	
	СуммаКСтрорнированию = Сумма;
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаКСтрорнированию > 0 Тогда
			
			Нов						=	Источник.Движения.Ар_РасчетыПоДоговорам.Добавить();
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	НачалоМесяца(ДокументРасчета.Дата);
			Нов.Организация			=	Договор.Организация;
			Нов.Контрагент			=	Договор.Владелец;
			Нов.ДоговорКонтрагента	=	Договор;
			Нов.ДокументРасчетов	=	ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	- ?(Рез.Сумма > СуммаКСтрорнированию, СуммаКСтрорнированию, Рез.Сумма);
			
			СуммаКСтрорнированию	=	СуммаКСтрорнированию + Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокументовСтарое

Процедура ПроведениеРеализация(Источник) Экспорт
	
	ЗДА = ПолучитьЗДА(Источник.ДоговорКонтрагента);
	
	Если Не ЗначениеЗаполнено(ЗДА) Тогда Возврат; КонецЕсли;
	
	Табл = ПолучитьДанныеЗДА(Источник.ДоговорКонтрагента);
	
	Если Табл.Количество() > 0 Тогда

		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Рег.Регистратор КАК Регистратор,
		                      |	Рег.ГруппаУслуг КАК ГруппаУслуг,
		                      |	Рег.Номенклатура КАК Номенклатура,
		                      |	Рег.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег
		                      |ГДЕ
		                      |	Рег.Месяц = &Месяц
		                      |	И Рег.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |	И Рег.ДоговорКонтрагента = &ДоговорКонтрагента
		                      |	И Рег.Регистратор <> &Ссылка
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Рег.Период");
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Источник.ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Источник.Дата));
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", Рез.Номенклатура);
			Отбор.Вставить("ГруппаУслуг", Рез.ГруппаУслуг);
			Поиск = Табл.НайтиСтроки(Отбор);
			Если Поиск.Количество() = 1 Тогда Стр = Поиск[0]; Иначе 
				Стр = Табл.Добавить(); 
				Стр.Услуга = Рез.Номенклатура;
				Стр.ГруппаУслуг = ?(ЗначениеЗаполнено(Рез.ГруппаУслуг) И Рез.ГруппаУслуг <> Справочники.АР_ГруппыУслуг.ПустаяСсылка(), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
				Стр.Приоритет = Стр.ГруппаУслуг.Приоритет;
				Стр.Остаток = 0;
				Табл.Сортировать("Приоритет Возр");
			КонецЕсли;
			
			Если ТипЗнч(Рез.Регистратор) = Тип("ДокументСсылка.АР17_ПроведениеДоговораАренды") Тогда
				
				Стр.Остаток = Стр.Остаток + Рез.Сумма;
								
			ИначеЕсли ТипЗнч(Рез.Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				Стр.Остаток = Стр.Остаток - Рез.Сумма;
								
			КонецЕсли;
			
		КонецЦикла;
		
		Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
		Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
		Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
		
		Если ЗначениеЗаполнено(ЗДА.ДоговорСобственника) Тогда
			
			ТабУслуг = Источник.АгентскиеУслуги.Выгрузить();
			
		Иначе
			
			ТабУслуг = Источник.Услуги.Выгрузить();
			
		КонецЕсли;
		
		//Для Каждого Стр Из Источник.Услуги Цикл
		Для Каждого Стр Из ТабУслуг Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", Стр.Номенклатура);
			
			Поиск = Табл.НайтиСтроки(Отбор);
			
			Сумма = Стр.Сумма;
			
			Для Каждого Т Из Поиск Цикл
				
				Если Сумма > 0 И Т.Остаток > 0 Тогда
				
					
					КСтронированию = ?(Т.Остаток >= Сумма, Сумма, Т.Остаток);
					Т.Остаток = Т.Остаток - КСтронированию;
					Сумма = Сумма - КСтронированию;
	
					Нов							=	Источник.Движения.АР_РасчетыПоДоговорам.Добавить();
					Нов.Период					=	Источник.Дата;
					Нов.ВидДвижения				=	ВидДвиженияНакопления.Расход;
					Нов.Месяц					=	НачалоМесяца(Источник.Дата);
					Нов.Контрагент				=	Источник.Контрагент;
					Нов.ДоговорКонтрагента		=	Источник.ДоговорКонтрагента;
					Нов.Сумма					=	КСтронированию;
					Нов.ГруппаУслуг				=	?(ЗначениеЗаполнено(Т.ГруппаУслуг) И Т.ГруппаУслуг <> Справочники.АР_ГруппыУслуг.ПустаяСсылка(), 
					Т.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
					Нов.Номенклатура			=	Стр.Номенклатура;
					Нов.Организация				=	Источник.Организация;
					
					Нов							=	Источник.Движения.АР_РасчетыПоДоговорам.Добавить();
					Нов.Период					=	Источник.Дата;
					Нов.ВидДвижения				=	ВидДвиженияНакопления.Приход;
					Нов.Месяц					=	НачалоМесяца(Источник.Дата);
					Нов.Контрагент				=	Источник.Контрагент;
					Нов.ДоговорКонтрагента		=	Источник.ДоговорКонтрагента;
					Нов.Сумма					=	КСтронированию;
					Нов.ГруппаУслуг				=	?(ЗначениеЗаполнено(Т.ГруппаУслуг) И Т.ГруппаУслуг <> Справочники.АР_ГруппыУслуг.ПустаяСсылка(), 
					Т.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
					Нов.Номенклатура			=	Стр.Номенклатура;
					Нов.Организация				=	Источник.Организация;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Сумма > 0 Тогда
				
				Нов							=	Источник.Движения.АР_РасчетыПоДоговорам.Добавить();
				Нов.Период					=	Источник.Дата;
				Нов.ВидДвижения				=	ВидДвиженияНакопления.Приход;
				Нов.Месяц					=	НачалоМесяца(Источник.Дата);
				Нов.Контрагент				=	Источник.Контрагент;
				Нов.ДоговорКонтрагента		=	Источник.ДоговорКонтрагента;
				Нов.Сумма					=	Сумма;
				Нов.ГруппаУслуг				=	Справочники.АР_ГруппыУслуг.БезГруппы;
				Нов.Номенклатура			=	Стр.Номенклатура;
				Нов.Организация				=	Источник.Организация;
				
			КонецЕсли;
									
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоступлениеНаРасчетныйСчет(Источник) Экспорт
		
	ЗДА = ПолучитьЗДА(Источник.ДоговорКонтрагента);
	
	Если Не ЗначениеЗаполнено(ЗДА) Тогда Возврат; КонецЕсли;
	
	Для Каждого СтрДвижения Из Источник.Движения.Хозрасчетный Цикл    
		
		КодКор = СтрДвижения.СчетКт.Код;
		
		Если СтрДвижения.СчетДт.Код = "51" И (КодКор = "62.01" Или КодКор = "62.02" Или КодКор = "76.06" Или КодКор = "76.09") Тогда
					
			СуммаДокумента = СтрДвижения.Сумма;
				
			Если СуммаДокумента > 0 Тогда 
		
				Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
				Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
				Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
				
				Запрос = Новый Запрос;
				
				Если ЗначениеЗаполнено(СтрДвижения.СубконтоКт.ДокументыРасчетовСКонтрагентами) И
					ТипЗнч(СтрДвижения.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					
					Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Рег.ГруппаУслуг,
					|	Рег.Номенклатура
					|ИЗ
					|	РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег
					|ГДЕ
					|	Рег.Регистратор = &Реализация";
					Запрос.УстановитьПараметр("Реализация", СтрДвижения.СубконтоКт.ДокументыРасчетовСКонтрагентами);
				Иначе					
					Запрос.Текст = "Выбрать Значение(Справочник.Ар_ГруппыУслуг.ПустаяСсылка) КАК ГруппаУслуг, Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура";					
				КонецЕсли;
				
				Приоритетные = Запрос.Выполнить().Выгрузить();
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	Таб.ГруппаУслуг КАК ГруппаУслуг,
				               |	Таб.Номенклатура КАК Номенклатура
				               |ПОМЕСТИТЬ ВТ
				               |ИЗ
				               |	&Таб КАК Таб
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
				               |	Рег.Номенклатура КАК Номенклатура,
				               |	СУММА(Рег.СуммаОстаток) КАК Сумма,
				               |	ВЫБОР
				               |		КОГДА ВТ.Номенклатура ЕСТЬ NULL
				               |			ТОГДА 2
				               |		ИНАЧЕ 1
				               |	КОНЕЦ КАК ПриоритетПоРеализациям,
				               |	ВЫБОР
				               |		КОГДА Рег.ГруппаУслуг = ЗНАЧЕНИЕ(Справочник.АР_ГруппыУслуг.ПустаяСсылка)
				               |			ТОГДА 99999
				               |		ИНАЧЕ Рег.ГруппаУслуг.Приоритет
				               |	КОНЕЦ КАК Приоритет
				               |ИЗ
				               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(
				               |			&МоментВремени,
				               |			ДоговорКонтрагента = &ДоговорКонтрагента
				               |				И Месяц = &Месяц) КАК Рег
				               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
				               |		ПО Рег.Номенклатура = ВТ.Номенклатура
				               |			И Рег.ГруппаУслуг = ВТ.ГруппаУслуг
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	Рег.ГруппаУслуг,
				               |	ВЫБОР
				               |		КОГДА Рег.ГруппаУслуг = ЗНАЧЕНИЕ(Справочник.АР_ГруппыУслуг.ПустаяСсылка)
				               |			ТОГДА 99999
				               |		ИНАЧЕ Рег.ГруппаУслуг.Приоритет
				               |	КОНЕЦ,
				               |	Рег.Номенклатура,
				               |	ВЫБОР
				               |		КОГДА ВТ.Номенклатура ЕСТЬ NULL
				               |			ТОГДА 2
				               |		ИНАЧЕ 1
				               |	КОНЕЦ
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	ПриоритетПоРеализациям,
				               |	Приоритет";
				Запрос.УстановитьПараметр("ДоговорКонтрагента", Источник.ДоговорКонтрагента);
				Запрос.УстановитьПараметр("Таб", Приоритетные); 
				Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Источник.Дата));
				Запрос.УстановитьПараметр("МоментВремени", Источник.Дата);
				
				Рез  = Запрос.Выполнить().Выбрать();
				
				Пока Рез.Следующий() Цикл
					
					Если СуммаДокумента > 0 Тогда
					
						КСписанию					=	?(СуммаДокумента > Рез.Сумма, Рез.Сумма, СуммаДокумента);
						СуммаДокумента				=	СуммаДокумента - КСписанию;
						
						Нов							=	Источник.Движения.АР_РасчетыПоДоговорам.Добавить();
						Нов.Период					=	Источник.Дата;
						Нов.Месяц					=	НачалоМесяца(Источник.Дата);
						Нов.ВидДвижения				=	ВидДвиженияНакопления.Расход;
						Нов.Организация				=	Источник.Организация;
						Нов.Контрагент				=	Источник.Контрагент;
						Нов.ДоговорКонтрагента		=	Источник.ДоговорКонтрагента;
						Нов.ГруппаУслуг				=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
						Нов.Номенклатура			=	Рез.Номенклатура;
						Нов.Сумма					=	КСписанию;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если СуммаДокумента > 0 Тогда
					
					// переплата
					Нов							=	Источник.Движения.АР_РасчетыПоДоговорам.Добавить();
					Нов.Период					=	Источник.Дата;
					Нов.Месяц					=	НачалоМесяца(Источник.Дата);
					Нов.ВидДвижения				=	ВидДвиженияНакопления.Расход;
					Нов.Организация				=	Источник.Организация;
					Нов.Контрагент				=	Источник.Контрагент;
					Нов.ДоговорКонтрагента		=	Источник.ДоговорКонтрагента;
					Нов.ГруппаУслуг				=	Справочники.АР_ГруппыУслуг.БезГруппы;
					Нов.Номенклатура			=	Справочники.Номенклатура.ПустаяСсылка();
					Нов.Сумма					=	СуммаДокумента;
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеКорректировкиДолга(Источник) Экспорт
	
	КонтрольУдаления = Истина;
	
	Для Каждого Стр Из Источник.ДебиторскаяЗадолженность Цикл Если Не Стр.Сделка.ПометкаУдаления Тогда КонтрольУдаления = Ложь; КонецЕсли; КонецЦикла;
	Для Каждого Стр Из Источник.КредиторскаяЗадолженность Цикл Если Не Стр.Сделка.ПометкаУдаления Тогда КонтрольУдаления = Ложь; КонецЕсли; КонецЦикла;
	
	Если КонтрольУдаления Тогда Возврат; КонецЕсли;
	
	Источник.Движения.Хозрасчетный.Прочитать();
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Организация");
	Табл.Колонки.Добавить("Период");
	Табл.Колонки.Добавить("ДоговорКонтрагента");
	Табл.Колонки.Добавить("Контрагент");
	Табл.Колонки.Добавить("ДокументРасчета");
	Табл.Колонки.Добавить("Сумма");
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
			
		Если Стр.СубконтоКт.Договоры <> Неопределено Тогда
			Код = Стр.СчетКт.Код;
			Если Код = "62.01" Или Код = "62.02" Или Код = "76.06" Или Код = "76.09" Тогда
				
				ЗДА = ПолучитьЗДА(Стр.СубконтоКт.Договоры);
				
				Если ЗначениеЗаполнено(ЗДА) Тогда
					
					Нов						=	Табл.Добавить();
					Нов.Организация			=	Стр.Организация;
					Нов.Период				=	Источник.Дата;
					Нов.ДоговорКонтрагента	=	Стр.СубконтоКт.Договоры;
					Нов.Контрагент			=	Стр.СубконтоКт.Договоры.Владелец;
					Нов.ДокументРасчета		=	Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами;
					Нов.Сумма				=	Стр.Сумма;

				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
			
		Если Стр.СубконтоДт.Договоры <> Неопределено Тогда
			Код = Стр.СчетДт.Код;
			Если Код = "62.01" Или Код = "62.02" Или Код = "76.06" Или Код = "76.09" Тогда
				
				ЗДА = ПолучитьЗДА(Стр.СубконтоДт.Договоры);
				
				Если ЗначениеЗаполнено(ЗДА) Тогда
					
					Нов						=	Табл.Добавить();
					Нов.Организация			=	Стр.Организация;
					Нов.Период				=	Источник.Дата;
					Нов.ДоговорКонтрагента	=	Стр.СубконтоДт.Договоры;
					Нов.Контрагент			=	Стр.СубконтоДт.Договоры.Владелец;
					Нов.ДокументРасчета		=	Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами;
					Нов.Сумма				=	- Стр.Сумма;
						
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
	Табл.Свернуть("Период, Организация, Контрагент, ДоговорКонтрагента, ДокументРасчета", "Сумма");
	
	Если Табл.Количество() > 0 Тогда
		
		Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
		//Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
		//Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
		Для Каждого Стр Из Табл Цикл
			
			СуммаПроводки = Стр.Сумма;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "Выбрать * Из РегистрНакопления.Ар_РасчетыПоДоговорам КАК Рег Где Рег.Регистратор = &ДокРасчета";
			Запрос.УстановитьПараметр("ДокРасчета", Стр.ДокументРасчета);
			Рез = Запрос.Выполнить().Выбрать();
			
			Пока Рез.Следующий() Цикл
				
				А = 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
